The end segment length for a grid must be at least [Length Value]
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId GridEndSegmentsLengthTooShort { get; }
  Visual Basic
Public Shared ReadOnly Property GridEndSegmentsLengthTooShort As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ GridEndSegmentsLengthTooShort {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GridFailures Class
  Autodesk.Revit.DB Namespace